const layoutData = [
    {
        title: 'Старт',
        link: '#',
        description: 'Познакомимся с преподавателями, наставниками и учебным процессом на курсе. Рассмотрим устройство веба и чем вы будете заниматься на работе. Установим и настроим инструменты для работы.'
    },
    {
        title: 'Разметка',
        link: '#',
        description: 'Создадим семантичную, доступную и выразительную разметку страниц проектов по макету.'
    },
    {
        title: 'Графика',
        link: '#',
        description: 'Экспортируем графику из макета, подключим контентную графику в разметку.'
    },
    {
        title: 'Базовая стилизация',
        link: '#',
        description: 'Выполним базовую стилизацию страниц проекта.'
    },
    {
        title: 'Сетки страниц на флексах',
        link: '#',
        description: 'Построим крупные сетки страниц с помощью флексов.'
    },
    {
        title: 'Сетки компонентов на флексах',
        link: '#',
        description: 'Создадим мелкие сетки компонентов страниц при помощи флексов.'
    },
    {
        title: 'Сетки компонентов на гридах',
        link: '#',
        description: 'Создадим мелкие сетки компонентов страниц при помощи гридов.'
    },
    {
        title: 'Декоративные элементы',
        link: '#',
        description: 'Добавим на страницы проектов мелкие декоративные и иконочные графические элементы. Стилизуем текстовые блоки, декоративные элементы внутри сеток компонентов, кнопки и ссылки.'
    },
    {
        title: 'Попапы, слайдеры, формы',
        link: '#',
        description: 'Сверстаем всплывающие элементы. Разберём приёмы стилизации форм и их элементов. Рассмотрим состояния и позиционирование элементов на странице.'
    },
    {
        title: 'Подготовка к защите',
        link: '#',
        description: 'Проверим проект на соответствие критериям качества и подготовим его к публикации.'
    },
    {
        title: 'Финал',
        link: '#',
        description: 'Завершение курса.'
    },
    {
        title: 'Проекты',
        link: '#',
        description: 'Описание проектов.'
    }
];

export default layoutData;
